<?php
$students = array(
'2010'=>'令狐冲',
'2011'=>'林平之',
'2012'=>'曲洋',
'2013'=>'任盈盈',
'2014'=>'向问天',
'2015'=>'任我行',
'2016'=>'冲虚',
'2017'=>'方正',
'2018'=>'岳不群',
'2019'=>'宁中则',
);//10个学生的学号和姓名，用数组存储

//使用循环结构遍历数组,获取学号和姓名  
foreach($students as $v)
{ 
    echo $v;//输出（打印）姓名
	echo "<br />";
}
echo "<br />";

//同时取下标和值
foreach($students as $n => $v)
{
    echo "下标是：".$n;//输出下标
    echo "&nbsp";//输出空格
    echo $v;//输出（打印）姓名
    echo "<br />";
}

/*
    在PHP中foreach循环语句，常用于遍历数组，一般有两种使用方式:不取下标、取下标。
    
    （1）只取值，不取下标
    
    <?php
     foreach (数组 as 值){
    //执行的任务
    }
    ?>
    （2）同时取下标和值
    
    <?php
    foreach (数组 as 下标 => 值){
     //执行的任务
    }
    ?>

*/
?>
